src/Test5_Cavity_Cylinder_2D/data/reference_data/openfoam_case/Allrun
#!/bin/sh
cd "${0%/*}" || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Create the base mesh
runApplication blockMesh

# Mesh the cylinder using snappyHexMesh
runApplication snappyHexMesh -overwrite

# Check the mesh
runApplication checkMesh

# Run the steady-state solver
runApplication $(getApplication)

# ----------------------------------------------------------------- end-of-file